//240920 금
/*for문 반복문 연습
for(초기문;조건문;종결문;){
}*/
//---------------------------------------------------
// for(let i=1;i<=10;i++){
//     console.log(`${i}x${i}=${i*i}`)}
//---------------------------------------------------
//배열에 있는숫자 차례로 출력
// let a = [11,22,33,44,55];
// for(let i=0;i<a.length;i++){
//     console.log(a[i])}
//---------------------------------------------------
//역순 출력
// let a = [1,2,3,4,5];
// for(let i=4;i>=0;i--){
//     console.log(a[i])}
//---------------------------------------------------
// for(let i in a){
//     console.log(a[i])
// }
//---------------------------------------------------
/*for in은 순서를넣음 of는 배열안의수를 넣음*/
// for(let item of a){
//     console.log(item)
// }
//---------------------------------------------------
//
// let arr = [Number("10"),"dit",true,undefined,function(){},{}]
// for(let i in arr){
//     console.log(`arr[${i}] = ${arr[i]}, (${typeof(arr[i])})`);
// }
//---------------------------------------------------
//배열안의 홀수값만 출력
let br = [123,456,789,101112,131415];
for(let i of br){
    if(i%2 == 1){console.log(`${i}`);}
}